//
//  ToDo.swift
//  Messenger
//
//  Created by e1ernal on 31.12.2023.
//

// MARK: ToDos:
/*

 [✅ Сделано] (commit GitHub)
 + парсер для даты последнего сообщения
 + распарсить получение данных чата
 + создание UI для чата с пользователем
 
 [🔥 Ключевой функционал] (Самое важное)
 - отправка сообщений пользователю
 - получение списка сообщений чата
 
 [✨ Доработка] (Что можно улучшить из реализованного функционала)
 - выделить текст ошибок в стандартный набор String
 - переписать ошибки в один формат
 
 [💡 Идеи] (Какой новый функционал можно добавить)
 - переписать POST метод в общем виде
 - просмотр изображения пользователя
 - посмотреть паттерны проектирования и применить их
 - добавить выбор страны номера телефона
 
 [⚠️ Ошибки] (Не влияют на работу приложения, исправить потом)
 - выбор ячейки таблицы (только содержимое)
 - исправить ошибки, которые возникают в консоли
 - разобраться с доступом к камере и фото
 - проставить selectionStyle = .none
 - popup view's сделать нормально, без лишнего (страницы регистрации)
 - ошибка редактирования данных пользователя (имя должно быть обязательным, фамилия нет)
    
 */
