//
//  ToDo.swift
//  Messenger
//
//  Created by e1ernal on 31.12.2023.
//

// MARK: ToDos:
/*
 
 [Sprint]
 - разобраться с доступом к камере и фото
 - исправить ошибки, которые возникают в консоли
    - Settings
    - остальные экраны
 - Рефакторинг
    + рефакторинг написанного кода (новый тип передаваемых данных)
    - выбор ячейки таблицы (только содержимое)
    - засунуть информацию о пользователе в локальную БД
 - Новый функционал
    - создание чата с пользователем
 
 [Ideas]
 - переписать POST метод в общем виде
 - просмотр изображения пользователя
 - посмотреть паттерны проектирования и применить их
 - добавить выбор страны номера телефона
 + переписать инициализацию VC через init
 + добавить страницу найденного пользователя
 + изменить UI просмотра данных пользователя
 + раскидать всё по extension
 + убрать @objc на одну строку
 + экран Launch Screen с загрузкой данных
 - причесать страницы регистрации
    - popup view's сделать нормально, без лишнего
 
 - Ошибки
    - выделить текст ошибок в стандартный набор String
    - переписать ошибки в один формат
 */
