//
//  ToDo.swift
//  Messenger
//
//  Created by e1ernal on 31.12.2023.
//

import Foundation

// MARK: ToDos:
/*
 - создать UI для ЛК пользователя
 - добавить алерты для отображения полученных данных и ошибок
 - разобраться с доступом к камере и фото
 - исправить ошибки, которые возникают при регистрации
 - добавить выбор страны номера телефона
 - добавить чтобы фичи крутились на приветственной странице
 - вынести стандартные элементы в отдельный класс
   - кнопки
   - лейблы
   - стеки
 - добавить обработку токена
   - при создании пользователя (конец регистрации)
   - при подтверждении номера телефона
 - переписать POST метод в общем виде
 */
