//
//  ToDo.swift
//  Messenger
//
//  Created by e1ernal on 31.12.2023.
//

import Foundation

// MARK: ToDos:
/*
 - разобраться с ошибкой 500 при создании пользователя
 - создать UI для ЛК пользователя
 - добавить алерты для отображения полученных данных и ошибок
 - разобраться с доступом к камере и фото
 - исправить ошибки, которые возникают при регистрации
 - добавить выбор страны номера телефона
 - в светлой теме не видны табы в экране приветствия
 - добавить чтобы фичи крутились на приветственной странице
 - вынести стандартные кнопки и стеки в отдельный класс
 */
