//
//  ToDo.swift
//  Messenger
//
//  Created by e1ernal on 31.12.2023.
//

// MARK: ToDos:
/*

 [✅ Сделано] (commit GitHub)
 + изменить UI header сообщений с датами
 + скругленные сообщения
 
 [🔥 Ключевой функционал] (Самое важное)
 - отправка сообщений пользователю
 - titleView собеседника в чате
 
 [✨ Доработка] (Что можно улучшить из реализованного функционала)
 - выделить текст ошибок в стандартный набор String
 - переписать ошибки в один формат
 - переписать POST метод в общем виде
 - Декомпозировать Networking
 - переписать модель данных, чтобы хранилось в Codable
 - проставить selectionStyle = .none
 - переписать модель через CodingKeys
 
 [💡 Идеи] (Какой новый функционал можно добавить)
 - просмотр изображения пользователя
 - посмотреть паттерны проектирования и применить их
 - добавить выбор страны номера телефона
 - вынести загрузку/обновление данных на экран чатов
 - добавить кастомный titleView с лоадером при загрузке
 - функционал редактирования чатов
 - функционал написания нового сообщения
 - поиск по сообщениям
 - прикрепить файлы к сообщению
 
 [⚠️ Ошибки] (Не влияют на работу приложения, исправить потом)
 - выбор ячейки таблицы (только содержимое)
 - исправить ошибки, которые возникают в консоли
 - разобраться с доступом к камере и фото
 - popup view's сделать нормально, без лишнего (страницы регистрации)
 - ошибка редактирования данных пользователя (имя должно быть обязательным, фамилия нет)
 */
